import numpy as np

# ввод координат левой нижней точки и правой верхней точки поля
field1 = [[0, 0], [30, 20]]

# ввод координат внутрених стен
# представление [[x1, y1], [x2, y2]] => [[x1, x2,], [y1, y2]]
walls1 = [[[10, 10], [10, 20]],
          [[20, 0], [20, 10]]]
for i in range(len(walls1)):
    walls1[i] = np.array(walls1[i]).transpose()

# ввод координат камер
cameras1 = np.array([[9, 15], [5, 1], [19, 5], [25, 19]]).transpose()

# ввод координат зон камер
selected_fields1 = [[[0, 10], [10, 20]],
                   [[0, 0], [10, 10]],
                   [[10, 0], [20, 10]],
                   [[20, 10], [30, 20]]]

# ввод координат вход/выход с указанием чем именно является
exits1 = [[5, 15, "Вход/выход"]]

# поле 50*50 с разлинованными секциями
field2 = [[0, 0], [50, 50]]
